-- * 국가 코드
CREATE TABLE country_codes (
    code_number TEXT PRIMARY KEY,
    description TEXT
);

INSERT INTO country_codes (code_number, description)
VALUES ('KR', '한국');

---- * 분류체계
CREATE TABLE classification_types (
    code_number TEXT PRIMARY KEY,
    classification_type TEXT,
    description TEXT
);

INSERT INTO classification_types (code_number, classification_type, description)
VALUES ('01', '표준산업분류체계', '산업자원에 대한 디지털 트윈 분류체계'),
       ('02', '공공자원분류체계', '디지털 트윈을 위한 공공자원 분류체계');


------ * 표준산업분류체계 대분류 코드
CREATE TABLE standard_industry_major_categories (
    code_number  TEXT PRIMARY KEY,
    classification_type_name TEXT,
    description TEXT
);

INSERT INTO standard_industry_major_categories (code_number, classification_type_name, description)
VALUES 
    ('A', '농업, 임업 및 어업', '농업, 임업 및 어업 자원에 대한 디지털 트윈 대분류 체계'),
    ('B', '광업', '광업 자원에 대한 디지털 트윈 대분류 체계'),
    ('C', '제조업', '제조업 자원에 대한 디지털 트윈 대분류 체계'),
    ('D', '전기, 가스, 증기 및 공기 조절 공급업', '전기, 가스, 증기 및 공기 조절 공급업 자원에 대한 디지털 트윈 대분류 체계'),
    ('E', '수도, 하수 및 폐기물 처리, 원료 재생업', '수도, 하수 및 폐기물 처리, 원료 재생업 자원에 대한 디지털 트윈 대분류 체계'),
    ('F', '건설업', '건설업 자원에 대한 디지털 트윈 대분류 체계'),
    ('G', '도매 및 소매업', '도매 및 소매업 자원에 대한 디지털 트윈 대분류 체계'),
    ('H', '운수 및 창고업', '운수 및 창고업 자원에 대한 디지털 트윈 대분류 체계'),
    ('I', '숙박 및 음식점업', '숙박 및 음식점업 자원에 대한 디지털 트윈 대분류 체계'),
    ('J', '정보통신업', '정보통신업 자원에 대한 디지털 트윈 대분류 체계'),
    ('K', '금융 및 보험업', '금융 및 보험업 자원에 대한 디지털 트윈 대분류 체계'),
    ('L', '부동산업', '부동산업 자원에 대한 디지털 트윈 대분류 체계'),
    ('M', '전문, 과학 및 기술 서비스업', '전문, 과학 및 기술 서비스업 자원에 대한 디지털 트윈 대분류 체계'),
    ('N', '사업시설 관리, 사업 지원 및 임대 서비스업', '사업시설 관리, 사업 지원 및 임대 서비스업 자원에 대한 디지털 트윈 대분류 체계'),
    ('O', '공공 행정, 국방 및 사회보장 행정', '공공 행정, 국방 및 사회보장 행정 자원에 대한 디지털 트윈 대분류 체계'),
    ('P', '교육 서비스업', '교육 서비스업 자원에 대한 디지털 트윈 대분류 체계');

-------- * 표준산업분류체계 제조업("C") 중분류 코드
CREATE TABLE standard_industry_categorie_c (
    code_number INT PRIMARY KEY,
    classification_type_name TEXT,
    description TEXT
);

INSERT INTO standard_industry_categorie_c (code_number, classification_type_name, description)
VALUES
    (10, '식료품 제조업', '육류, 수산물, 과실, 채소, 낙농제품 등 식품 제조업'),
    (11, '음료 제조업', '알코올, 비알코올 음료 제조업'),
    (12, '담배 제조업', '담배 제조업'),
    (13, '섬유제품 제조업', '방적, 직물 직조, 편조 원단 등 섬유제품 제조업'),
    (14, '의복 및 액세서리, 모피제품 제조업', '봉제의복, 모피제품, 편조의복, 의복 액세서리 제조업'),
    (15, '가죽, 가방 및 신발 제조업', '가죽, 가방 및 유사 제품, 신발 및 신발 부분품 제조업'),
    (16, '목재 및 나무제품 제조업', '제재 및 목재 가공업, 나무제품, 코르크 및 조물 제품 제조업'),
    (17, '펄프, 종이 및 종이제품 제조업', '펄프, 종이 및 판지, 골판지, 종이 상자 및 종이 용기, 기타 종이 및 판지 제품 제조업'),
    (18, '인쇄 및 기록매체 복제업', '인쇄 및 인쇄관련 산업, 기록매체 복제업'),
    (19, '코크스, 연탄 및 석유 정제품 제조업', '코크스, 연탄, 석유 정제품 제조업'),
    (20, '화학 물질 및 화학제품 제조업', '기초 화학물질, 합성고무 및 플라스틱 물질, 비료, 농약 및 살균․살충제, 기타 화학제품, 화학섬유 제조업'),
    (21, '의료용 물질 및 의약품 제조업', '기초 의약 물질 및 생물학적 제제, 의약품, 의료용품 및 기타 의약 관련제품 제조업'),
    (22, '고무 및 플라스틱제품 제조업', '고무제품, 플라스틱 제품 제조업'),
    (23, '비금속 광물제품 제조업', '유리 및 유리제품, 내화, 비내화 요업제품, 시멘트, 석회, 플라스터 및 그 제품, 기타 비금속 광물제품 제조업'),
    (24, '1차 금속 제조업', '1차 철강, 1차 비철금속 제조업, 금속 주조업'),
    (25, '금속 가공제품 제조업', '구조용 금속제품, 탱크 및 증기발생기, 무기 및 총포탄, 기타 금속 가공제품 제조업'),
    (26, '전자 부품, 컴퓨터, 영상, 음향 및 통신장비 제조업', '반도체, 전자 부품, 컴퓨터 및 주변 장치, 통신 및 방송장비, 영상 및 음향 기기, 마그네틱 및 광학 매체 제조업'),
    (27, '의료, 정밀, 광학 기기 및 시계 제조업', '의료용 기기, 측정, 시험, 항해, 제어 및 기타 정밀 기기, 사진장비 및 광학 기기, 시계 및 시계 부품 제조업'),
    (28, '전기장비 제조업', '전동기, 발전기 및 전기 변환․공급․제어 장치, 일차전지 및 축전지, 절연선 및 케이블, 전구 및 조명장치, 가정용 기기, 기타 전기장비 제조업'),
    (29, '기타 기계 및 장비 제조업', '일반 목적용 기계, 특수 목적용 기계 제조업'),
    (30, '자동차 및 트레일러 제조업', '자동차용 엔진 및 자동차, 자동차 차체 및 트레일러, 자동차 신품 부품, 자동차 재제조 부품 제조업'),
    (31, '기타 운송장비 제조업', '선박 및 보트 건조업, 철도장비, 항공기, 우주선 및 부품, 그 외 기타 운송장비 제조업'),
    (32, '가구 제조업', '가구 제조업'),
    (33, '기타 제품 제조업', '귀금속 및 장신용품, 악기, 운동 및 경기용구, 인형, 장난감 및 오락용품, 그 외 기타 제품 제조업'),
    (34, '산업용 기계 및 장비 수리업', '산업용 기계 및 장비 수리업');

------ * 공공자원분류체계 대분류 코드
CREATE TABLE public_resource_major_categories (
    code_number TEXT PRIMARY KEY,
    classification_type_name TEXT,
    description TEXT
);

INSERT INTO public_resource_major_categories (code_number, classification_type_name, description)
VALUES
    ('A', '공공행정', '공공자원 자원에 대한 디지털 트윈 대분류 체계'),
    ('B', '과학기술', '과학기술 자원에 대한 디지털 트윈 대분류 체계'),
    ('C', '교통물류', '교통물류 자원에 대한 디지털 트윈 대분류 체계'),
    ('D', '국토관리', '국토관리 자원에 대한 디지털 트윈 대분류 체계'),
    ('E', '사회복지', '사회복지 자원에 대한 디지털 트윈 대분류 체계'),
    ('F', '산업고용', '산업고용 자원에 대한 디지털 트윈 대분류 체계'),
    ('G', '식품건강', '식품건강 자원에 대한 디지털 트윈 대분류 체계'),
    ('H', '재난안전', '재난안전 자원에 대한 디지털 트윈 대분류 체계'),
    ('I', '재정금융', '재정금융 자원에 대한 디지털 트윈 대분류 체계'),
    ('J', '통일외교안보', '통일외교안보 자원에 대한 디지털 트윈 대분류 체계'),
    ('K', '환경기상', '환경기상 자원에 대한 디지털 트윈 대분류 체계'),
    ('L', '교육', '교육 자원에 대한 디지털 트윈 대분류 체계'),
    ('M', '농축수산', '농축수산 자원에 대한 디지털 트윈 대분류 체계'),
    ('N', '문화관광', '문화관광 자원에 대한 디지털 트윈 대분류 체계'),
    ('O', '법률', '법률 자원에 대한 디지털 트윈 대분류 체계'),
    ('P', '보건의료', '보건의료 자원에 대한 디지털 트윈 대분류 체계');

-------- * 공공자원분류체계 교통물류("C") 분야 분류 코드
CREATE TABLE public_resource_categorie_c (
    code_number INT PRIMARY KEY,
    classification_type_name TEXT,
    description TEXT
);

INSERT INTO public_resource_categorie_c (code_number, classification_type_name, description)
VALUES
    (10000, '항공·공항', '항공 운항 통계 등 항공·공항 자원 정보와 관련된 디지털 트윈 분류 체계'),
    (20000, '도로', '대중 교통 현황 등 도로 자원 정보와 관련된 디지털 트윈 분류 체계'),
    (30000, '철도', '여객 열차 정보 등 철도 자원과 관련된 디지털 트윈 분류 체계'),
    (40000, '해운·항만', '항만시설장비현황 등 해운·항만 자원과 관련된 디지털 트윈 분류 체계'),
    (50000, '물류 및 기타', '주차장 정보 등 물류 및 기타 교통 자원 정보와 관련된 디지털 트윈 분류 체계');

-------- * 공공자원분류체계 환경기상("K") 분야 분류 코드
CREATE TABLE public_resource_categorie_k (
    code_number INT PRIMARY KEY,
    classification_type_name TEXT,
    description TEXT
);

INSERT INTO public_resource_categorie_k (code_number, classification_type_name, description)
VALUES
    (10000, '대기', '대기 오염도 현황 등 대기 환경 정보와 관련된 디지털 트윈 분류 체계'),
    (10001, '대기 - 날씨', '기온 등 대기와 관련된 기상 정보를 나타내는 디지털 트윈 분류 체계'),
    (10002, '대기 - 미세먼지', '미세먼지 현황에 관련된 정보를 나타내는 디지털 트윈 분류 체계'),
    (20000, '폐기물', '폐기물 발생 및 재활용 실적 등 자원 순환 정보와 관련된 디지털 트윈 분류 체계'),
    (30000, '상하수도·수질', '수질 오염 실태 등 수자원 환경 정보와 관련된 디지털 트윈 분류 체계'),
    (40000, '자연', '한국산 생물종 현황 등 생태 환경 정보와 관련된 디지털 트윈 분류 체계'),
    (50000, '해양환경', '연안 및 해양 수질 현황 등 해양환경 정보와 관련된 디지털 트윈 분류 체계'),
    (60000, '환경일반', '환경기초시설 등 환경 보건 정보와 관련된 디지털 트윈 분류 체계');

-------- * 공공자원분류체계 문화관광("N") 분야 분류 코드
CREATE TABLE public_resource_categorie_n (
    code_number INT PRIMARY KEY,
    classification_type_name TEXT,
    description TEXT
);

INSERT INTO public_resource_categorie_n (code_number, classification_type_name, description)
VALUES
    (10000, '관광', '숙박업 현황 등 여행 및 관광 정보에 대한 디지털 트윈 분류 체계'),
    (20000, '문화예술', '공연 시설 운영 현황 등 문화 예술 정보와 관련된 디지털 트윈 분류 체계'),
    (30000, '문화재', '문화재 정보 등 문화 유산 정보에 대한 디지털 트윈 분류 체계'),
    (40000, '체육', '일반 체육 시설 현황 등 국민 생활 체육 정보에 대한 디지털 트윈 분류 체계'),
    (50000, '문화체육관광일반', '국민 여가 활동 정보 등 문화 관광 전반의 분야에 대한 디지털 트윈 분류 체계');
